-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Сен 14 2020 г., 15:59
-- Версия сервера: 10.4.13-MariaDB
-- Версия PHP: 7.4.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `title`) VALUES
(5, 'Рубашки'),
(6, 'Футболки'),
(7, 'Майки');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `products` text NOT NULL,
  `create_at` datetime NOT NULL DEFAULT current_timestamp(),
  `address` text NOT NULL,
  `status` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `products`, `create_at`, `address`, `status`) VALUES
(11, 1, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":1,\"cost\":\"250\"}]}', '2020-09-12 14:24:30', '555', 'Отправлен клиенту'),
(13, 2, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":1,\"cost\":\"250\"}]}', '2020-09-12 14:27:13', '333', 'Отправлен клиенту'),
(16, 4, '{\"basket\":[{\"product_id\":\"9\",\"count\":4,\"cost\":400}]}', '2020-09-12 23:12:35', '145', 'Отправлен клиенту'),
(17, 5, '{\"basket\":[{\"product_id\":\"12\",\"count\":1,\"cost\":\"200\"},{\"product_id\":\"13\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"14\",\"count\":2,\"cost\":460}]}', '2020-09-12 23:18:09', '666', 'Новый'),
(23, 1, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":3,\"cost\":750}]}', '2020-09-13 00:27:39', '555', 'Отправлен клиенту'),
(24, 6, '{\"basket\":[{\"product_id\":\"9\",\"count\":2,\"cost\":200},{\"product_id\":\"12\",\"count\":2,\"cost\":400}]}', '2020-09-13 00:28:43', '999', 'Новый'),
(25, 7, '{\"basket\":[{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":2,\"cost\":500},{\"product_id\":\"14\",\"count\":1,\"cost\":\"230\"}]}', '2020-09-14 06:35:28', '', 'Отправлен клиенту'),
(26, 8, '{\"basket\":[]}', '2020-09-14 06:44:16', '1', 'Новый'),
(27, 9, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"}]}', '2020-09-14 06:47:51', '2', 'Отправлен клиенту');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `content` text NOT NULL,
  `category_id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `cost` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `title`, `description`, `content`, `category_id`, `image`, `cost`) VALUES
(9, 'Майка дрозд', 'Желтая', 'Очень легкая.', 7, '', '100'),
(10, 'Футблока мол', 'Белая', 'Очень дышащая, не потеет', 6, '', '150'),
(11, 'Рубашка тор', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '250'),
(12, 'Майка фемел', 'Желтая', 'Очень легкая.', 7, '', '200'),
(13, 'Кир', 'Белая', 'Очень дышащая, не потеет', 6, '', '100'),
(14, 'Дута', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '230'),
(15, 'Пора', 'Желтая', 'Очень легкая.', 7, '', '220'),
(16, 'Тима', 'Белая', 'Очень дышащая, не потеет', 6, '', '200'),
(17, 'Круза', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '110'),
(18, 'Фира', 'Желтая', 'Очень легкая.', 7, '', '120'),
(19, 'Рома', 'Белая', 'Очень дышащая, не потеет', 6, '', '130'),
(20, 'Тара', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '152'),
(21, 'Ирма', 'Желтая', 'Очень легкая.', 7, '', '500'),
(22, 'Фруна', 'Белая', 'Очень дышащая, не потеет', 6, '', '60'),
(23, 'Ропа', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '65'),
(24, 'Инда', 'Желтая', 'Очень легкая.', 7, '', '85'),
(25, 'Хирим', 'Белая', 'Очень дышащая, не потеет', 6, '', '95'),
(26, 'Фама', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '80'),
(27, 'Трила', 'Желтая', 'Очень легкая.', 7, '', '70'),
(28, 'Парк', 'Белая', 'Очень дышащая, не потеет', 6, '', '10'),
(29, 'Торманис', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '60'),
(30, 'Фимуса', 'Желтая', 'Очень легкая.', 7, '', '30'),
(31, 'Инда', 'Белая', 'Очень дышащая, не потеет', 6, '', '40'),
(32, 'Ротол', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '95'),
(33, 'Парам', 'Желтая', 'Очень легкая.', 7, '', '90'),
(34, 'Пил', 'Белая', 'Очень дышащая, не потеет', 6, '', '95'),
(35, 'Не пил', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '60'),
(36, 'Кидло', 'Желтая', 'Очень легкая.', 7, '', '75'),
(59, 'Майка дрозд', 'Желтая', 'Очень легкая.', 7, '', '100'),
(60, 'Футблока мол', 'Белая', 'Очень дышащая, не потеет', 6, '', '150'),
(61, 'Рубашка тор', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '250'),
(62, 'Майка фемел', 'Желтая', 'Очень легкая.', 7, '', '200'),
(63, 'Кир', 'Белая', 'Очень дышащая, не потеет', 6, '', '100'),
(64, 'Дута', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '230'),
(65, 'Пора', 'Желтая', 'Очень легкая.', 7, '', '220'),
(66, 'Тима', 'Белая', 'Очень дышащая, не потеет', 6, '', '200'),
(67, 'Круза', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '110'),
(68, 'Фира', 'Желтая', 'Очень легкая.', 7, '', '120'),
(69, 'Рома', 'Белая', 'Очень дышащая, не потеет', 6, '', '130'),
(70, 'Тара', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '152'),
(71, 'Ирма', 'Желтая', 'Очень легкая.', 7, '', '500'),
(72, 'Фруна', 'Белая', 'Очень дышащая, не потеет', 6, '', '60'),
(73, 'Ропа', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '65'),
(74, 'Инда', 'Желтая', 'Очень легкая.', 7, '', '85'),
(75, 'Хирим', 'Белая', 'Очень дышащая, не потеет', 6, '', '95'),
(76, 'Фама', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '80'),
(77, 'Трила', 'Желтая', 'Очень легкая.', 7, '', '70'),
(78, 'Парк', 'Белая', 'Очень дышащая, не потеет', 6, '', '10'),
(79, 'Торманис', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '60'),
(80, 'Фимуса', 'Желтая', 'Очень легкая.', 7, '', '30'),
(81, 'Инда', 'Белая', 'Очень дышащая, не потеет', 6, '', '40'),
(82, 'Ротол', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '95'),
(83, 'Парам', 'Желтая', 'Очень легкая.', 7, '', '90'),
(84, 'Пил', 'Белая', 'Очень дышащая, не потеет', 6, '', '95'),
(85, 'Не пил', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '60'),
(86, 'Кидло', 'Желтая', 'Очень легкая.', 7, '', '75');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `confirm_mail` varchar(255) NOT NULL,
  `verifided` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `phone`, `email`, `password`, `confirm_mail`, `verifided`) VALUES
(24, 'qwerty', '', 'qwerty@i.ua', 'd8578edf8458ce06fbc5bb76a58c5ca4', '', 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
