-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Сен 12 2020 г., 23:29
-- Версия сервера: 10.4.13-MariaDB
-- Версия PHP: 7.4.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `title`) VALUES
(5, 'Рубашки'),
(6, 'Футболки'),
(7, 'Майки');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `products` text NOT NULL,
  `create_at` datetime NOT NULL DEFAULT current_timestamp(),
  `address` text NOT NULL,
  `status` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `products`, `create_at`, `address`, `status`) VALUES
(11, 1, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":1,\"cost\":\"250\"}]}', '2020-09-12 14:24:30', '555', 'Отправлен клиенту'),
(13, 2, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":1,\"cost\":\"250\"}]}', '2020-09-12 14:27:13', '333', 'Отправлен клиенту'),
(16, 4, '{\"basket\":[{\"product_id\":\"9\",\"count\":4,\"cost\":400}]}', '2020-09-12 23:12:35', '145', 'Отправлен клиенту'),
(17, 5, '{\"basket\":[{\"product_id\":\"12\",\"count\":1,\"cost\":\"200\"},{\"product_id\":\"13\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"14\",\"count\":2,\"cost\":460}]}', '2020-09-12 23:18:09', '666', 'Новый'),
(23, 1, '{\"basket\":[{\"product_id\":\"9\",\"count\":1,\"cost\":\"100\"},{\"product_id\":\"10\",\"count\":1,\"cost\":\"150\"},{\"product_id\":\"11\",\"count\":3,\"cost\":750}]}', '2020-09-13 00:27:39', '555', 'Отправлен клиенту'),
(24, 6, '{\"basket\":[{\"product_id\":\"9\",\"count\":2,\"cost\":200},{\"product_id\":\"12\",\"count\":2,\"cost\":400}]}', '2020-09-13 00:28:43', '999', 'Новый');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `content` text NOT NULL,
  `category_id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `cost` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `title`, `description`, `content`, `category_id`, `image`, `cost`) VALUES
(9, '1', 'Желтая', 'Очень легкая.', 7, '', '100'),
(10, '2', 'Белая', 'Очень дышащая, не потеет', 6, '', '150'),
(11, '3', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '250'),
(12, '4', 'Желтая', 'Очень легкая.', 7, '', '200'),
(13, '5', 'Белая', 'Очень дышащая, не потеет', 6, '', '100'),
(14, '6', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '230'),
(15, '7', 'Желтая', 'Очень легкая.', 7, '', '220'),
(16, '8', 'Белая', 'Очень дышащая, не потеет', 6, '', '200'),
(17, '9', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '110'),
(18, '10', 'Желтая', 'Очень легкая.', 7, '', '120'),
(19, '11', 'Белая', 'Очень дышащая, не потеет', 6, '', '130'),
(20, '12', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '152'),
(21, '13', 'Желтая', 'Очень легкая.', 7, '', '500'),
(22, '14', 'Белая', 'Очень дышащая, не потеет', 6, '', '60'),
(23, '15', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '65'),
(24, '16', 'Желтая', 'Очень легкая.', 7, '', '85'),
(25, '17', 'Белая', 'Очень дышащая, не потеет', 6, '', '95'),
(26, '18', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '80'),
(27, '19', 'Желтая', 'Очень легкая.', 7, '', '70'),
(28, '20', 'Белая', 'Очень дышащая, не потеет', 6, '', '10'),
(29, '21', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '60'),
(30, '22', 'Желтая', 'Очень легкая.', 7, '', '30'),
(31, '23', 'Белая', 'Очень дышащая, не потеет', 6, '', '40'),
(32, '24', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '95'),
(33, '25', 'Желтая', 'Очень легкая.', 7, '', '90'),
(34, '26', 'Белая', 'Очень дышащая, не потеет', 6, '', '95'),
(35, '27', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '60'),
(36, '28', 'Желтая', 'Очень легкая.', 7, '', '75'),
(37, '29', 'Белая', 'Очень дышащая, не потеет', 6, '', '55'),
(38, '30', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '45'),
(39, '31', 'Желтая', 'Очень легкая.', 7, '', '35'),
(40, '32', 'Белая', 'Очень дышащая, не потеет', 6, '', '30'),
(41, '33', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '40'),
(42, '34', 'Желтая', 'Очень легкая.', 7, '', '50'),
(43, '35', 'Белая', 'Очень дышащая, не потеет', 6, '', '90'),
(44, '36', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '150'),
(45, '37', 'Желтая', 'Очень легкая.', 7, '', '900'),
(46, '38', 'Белая', 'Очень дышащая, не потеет', 6, '', '500'),
(47, '39', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '400'),
(48, '40', 'Желтая', 'Очень легкая.', 7, '', '300'),
(49, '41', 'Белая', 'Очень дышащая, не потеет', 6, '', '700'),
(50, '42', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '100'),
(51, '43', 'Желтая', 'Очень легкая.', 7, '', '160'),
(52, '44', 'Белая', 'Очень дышащая, не потеет', 6, '', '320'),
(53, '45', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '240'),
(54, '46', 'Желтая', 'Очень легкая.', 7, '', '320'),
(55, '47', 'Белая', 'Очень дышащая, не потеет', 6, '', '470'),
(56, '48', 'Похожа на тельняшку', 'Хорошо подойдет порячкам', 5, '', '450'),
(58, 'Футболка бежевая', 'Теплая', 'Зимняя', 6, '', '650');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `phone`, `email`) VALUES
(1, '555', '555', ''),
(2, '333', '333', ''),
(4, '145', '145', ''),
(5, '666', '666', ''),
(6, '999', '999', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
